# Задание 7
a = input()
print(int(eval(a)))

# Этот код выполняет условия конкретной данной задачи, однако если будет общий случай, то необходима проверка входящей строки через try: except: Грубо говоря, код ОЧЕНЬ НЕ безопасный